Revit 2027 API
ParameterTypeId.ViewportSheetNumber Property
 "Sheet Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewportSheetNumber { get; }
Public Shared ReadOnly Property ViewportSheetNumber As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewportSheetNumber {
	ForgeTypeId^ get ();
}
static member ViewportSheetNumber : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace